#3- Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
#Пример: при N = 12 -> [2, 3]

from MathWork import GetMultipliers, GetMulti

N = 12

print(f'N = {N} -> {GetMulti(N)}')
print(f'N = {N} -> {GetMultipliers(N)}')
