#3 - Создайте два списка — один с названиями языков программирования, другой — с числами от 1 до длины первого.
#['python', 'c#']
#[1,2]
#Вам нужно сделать две функции: первая из которых создаст список кортежей, состоящих из номера и языка, написанного большими буквами.
#[(1,'PYTHON'), (2,'C#')]
#Вторая — которая отфильтрует этот список следующим образом: если сумма очков слова имеет в делителях номер, с которым она в паре в кортеже, то кортеж остается, его номер заменяется на сумму очков.
#[сумма очков c# = 102, в делителях есть 2 с которым в паре. Значит список будет]
#[(1,'PYTHON'), (102,'C#')]
#Если нет — удаляется. Суммой очков называется сложение порядковых номеров букв в слове. Порядковые номера смотрите в этой таблице, в третьем столбце: https://www.charset.org/utf-8
#Это — 16-ричная система, поищите, как правильнее и быстрее получать эти символы.** По желанию: ** просто верните список. Или с помощью reduce сложите получившиеся числа и верните из функции в качестве ответа.

from ListWork import ZipTwoList
from WordsWork import ScoreWords


path = "programming languages.txt"
with open(path) as f:
    languages = [line[:-1] for line in f.readlines() if line[:-1] != '']

#languages = ['python', 'c#']
idx_languages = [idx+1 for idx in range(len(languages))]

arr = ZipTwoList(idx_languages, languages)
print(ScoreWords(arr))

