#Задача: предложить улучшения кода для уже решённых задач:
#- С помощью использования лямбд, filter, map, zip, enumerate, list comprehension, reduce
#6-Сформировать список из  N членов последовательности.
#Для N = 5: 1, -3, 9, -27, 81 и т.д.

from MathWork import Seq

sq = Seq()

print(sq.get_num(5))
print(sq.get_num(10))
