#Задача: предложить улучшения кода для уже решённых задач:
#- С помощью использования лямбд, filter, map, zip, enumerate, list comprehension, reduce
#2- Найти сумму чисел списка стоящих на нечетной позиции

from typing import List, Union
from MathWork import SumListNumbers


print(SumListNumbers([1, 2, 3, 4]))
